Revit 2027 API
NumberSystem.NumberedElementId Property
 The LinkElementId of the numbered host element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId NumberedElementId { get; }
Public ReadOnly Property NumberedElementId As LinkElementId
	Get
public:
property LinkElementId^ NumberedElementId {
	LinkElementId^ get ();
}
member NumberedElementId : LinkElementId with get
Property Value
LinkElementId
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace